testing/performance/national-scale-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
            testname="Mayo EMR National Scale Load Test" enabled="true">
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables"
                enabled="true">
                <collectionProp name="Arguments.arguments">
                    <elementProp name="BASE_URL" elementType="Argument">
                        <stringProp name="Argument.name">BASE_URL</stringProp>
                        <stringProp name="Argument.value">http://localhost:8080</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="AUTH_SERVICE_URL" elementType="Argument">
                        <stringProp name="Argument.name">AUTH_SERVICE_URL</stringProp>
                        <stringProp name="Argument.value">http://localhost:8081</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="PATIENT_SERVICE_URL" elementType="Argument">
                        <stringProp name="Argument.name">PATIENT_SERVICE_URL</stringProp>
                        <stringProp name="Argument.value">http://localhost:8082</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="SYNC_SERVICE_URL" elementType="Argument">
                        <stringProp name="Argument.name">SYNC_SERVICE_URL</stringProp>
                        <stringProp name="Argument.value">http://localhost:8084</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="AUDIT_SERVICE_URL" elementType="Argument">
                        <stringProp name="Argument.name">AUDIT_SERVICE_URL</stringProp>
                        <stringProp name="Argument.value">http://localhost:8085</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                    <elementProp name="NOTIFICATION_SERVICE_URL" elementType="Argument">
                        <stringProp name="Argument.name">NOTIFICATION_SERVICE_URL</stringProp>
                        <stringProp name="Argument.value">http://localhost:8086</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                </collectionProp>
            </elementProp>
        </TestPlan>
        <hashTree>
            <!-- Authentication Load Test -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Authentication Load Test" enabled="true">
                <stringProp name="TestPlan.comments">Simulate 10,000 concurrent users authenticating</stringProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller"
                    enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">10</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">1000</stringProp>
                <stringProp name="ThreadGroup.ramp_time">60</stringProp>
                <longProp name="ThreadGroup.start_time">1</longProp>
                <longProp name="ThreadGroup.end_time">1</longProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="User Registration" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{
                                    "email": "user_${__Random(1,100000)}@test.com",
                                    "password": "SecurePass123!",
                                    "fullName": "Test User ${__Random(1,100000)}",
                                    "userType": "PATIENT"
                                    }</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${AUTH_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8081</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/api/v1/auth/register</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                </HTTPSamplerProxy>
                <hashTree />
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="User Login" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{
                                    "email": "user_${__Random(1,100000)}@test.com",
                                    "password": "SecurePass123!"
                                    }</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${AUTH_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8081</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>

            <!-- Family Accounts Load Test -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Family Accounts Load Test" enabled="true">
                <stringProp name="TestPlan.comments">Simulate family account creation and management</stringProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller"
                    enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">5</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">500</stringProp>
                <stringProp name="ThreadGroup.ramp_time">30</stringProp>
                <longProp name="ThreadGroup.start_time">1</longProp>
                <longProp name="ThreadGroup.end_time">1</longProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Create Family" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{
                                    "name": "Family ${__Random(1,50000)}",
                                    "description": "Test family for load testing"
                                    }</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${AUTH_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8081</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/api/v1/families</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <stringProp name="HTTPSampler.header_manager">Bearer ${JWT_TOKEN}</stringProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>

            <!-- Patient Ownership Transfer Load Test -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Ownership Transfer Load Test" enabled="true">
                <stringProp name="TestPlan.comments">Simulate patient ownership transfers</stringProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller"
                    enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">3</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">200</stringProp>
                <stringProp name="ThreadGroup.ramp_time">20</stringProp>
                <longProp name="ThreadGroup.start_time">1</longProp>
                <longProp name="ThreadGroup.end_time">1</longProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Initiate Ownership Transfer" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{
                                    "newOwnerId": "${__UUID()}",
                                    "reason": "Family transfer load test",
                                    "confirmationRequired": true
                                    }</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${PATIENT_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8082</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">
                        /api/v1/patients/${__UUID()}/transfer-ownership</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <stringProp name="HTTPSampler.header_manager">Bearer ${JWT_TOKEN}</stringProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>

            <!-- Sync Service Load Test -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Sync Service Load Test" enabled="true">
                <stringProp name="TestPlan.comments">Simulate offline sync operations</stringProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller"
                    enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">20</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">300</stringProp>
                <stringProp name="ThreadGroup.ramp_time">45</stringProp>
                <longProp name="ThreadGroup.start_time">1</longProp>
                <longProp name="ThreadGroup.end_time">1</longProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Device Sync" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{
                                    "userId": "${__UUID()}",
                                    "deviceId": "${__UUID()}",
                                    "changes": [
                                    {
                                    "recordId": "${__UUID()}",
                                    "changeType": "UPDATE",
                                    "version": ${__Random(1,1000)},
                                    "data": "{\"field\":\"value_${__Random(1,1000)}\"}"
                                    }
                                    ],
                                    "lastSyncVersion": ${__Random(1,1000)}
                                    }</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${SYNC_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8084</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/api/v1/sync/sync</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <stringProp name="HTTPSampler.header_manager">Bearer ${JWT_TOKEN}</stringProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>

            <!-- Audit Service Load Test -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Audit Service Load Test" enabled="true">
                <stringProp name="TestPlan.comments">Simulate audit log queries</stringProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller"
                    enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">15</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">100</stringProp>
                <stringProp name="ThreadGroup.ramp_time">15</stringProp>
                <longProp name="ThreadGroup.start_time">1</longProp>
                <longProp name="ThreadGroup.end_time">1</longProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Audit Events Query" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${AUDIT_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8085</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">
                        /api/audit/events?page=0&amp;size=50&amp;action=PATIENT_ACCESSED</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <stringProp name="HTTPSampler.header_manager">Bearer ${JWT_TOKEN}</stringProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>

            <!-- Notification Service Load Test -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Notification Service Load Test" enabled="true">
                <stringProp name="TestPlan.comments">Simulate notification sending</stringProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller"
                    enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">25</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">400</stringProp>
                <stringProp name="ThreadGroup.ramp_time">50</stringProp>
                <longProp name="ThreadGroup.start_time">1</longProp>
                <longProp name="ThreadGroup.end_time">1</longProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Send Notification" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{
                                    "userId": "${__UUID()}",
                                    "type": "APPOINTMENT_REMINDER",
                                    "title": "Appointment Reminder",
                                    "message": "You have an appointment in ${__Random(1,24)} hours",
                                    "priority": "HIGH",
                                    "channels": ["PUSH", "EMAIL"]
                                    }</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">${NOTIFICATION_SERVICE_URL}</stringProp>
                    <stringProp name="HTTPSampler.port">8086</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/api/v1/notifications/send</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <stringProp name="HTTPSampler.header_manager">Bearer ${JWT_TOKEN}</stringProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>

            <!-- Results and Reporting -->
            <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                testname="View Results Tree" enabled="true">
                <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree />

            <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                testname="Summary Report" enabled="true">
                <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree />
        </hashTree>
    </hashTree>
</jmeterTestPlan>